// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает 
//все чётные числа от 1 до N.
//5 -> 2, 4
//8 -> 2, 4, 6, 8

int numberA, i;
numberA =8;
i = 2;

while (i <= numberA)
 {
     Console.WriteLine($"{i}, ");
     i = i + 2;

 }


